1) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/Category.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
         }
         $this->viewInterface->addTlpParam('categoryList', $this->categoryRepository->getList());
-        $this->viewInterface->addTemplate('backend/category.tpl');
+        
     }
 }

2) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:44    [M] CastInt

--- Original
+++ New
@@ @@
     }
     public function action() : void
     {
-        $category = $this->categoryRepository->getById((int) $_GET['categoryID']);
+        $category = $this->categoryRepository->getById($_GET['categoryID']);
         $editCategoryName = $_POST['editCategoryName'] ?? $category->categoryname;
         if (isset($_POST['updateCategory'])) {
             if ($editCategoryName === '') {

3) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:51    [M] ArrayItem

--- Original
+++ New
@@ @@
             if ($editCategoryName === '') {
                 $this->viewInterface->addTlpParam('error', ['category' => 'Product Name musst be given']);
             } else {
-                $mappedCategory = $this->categoryMapper->map(['CategoryName' => $editCategoryName, 'CategoryID' => $category->id]);
+                $mappedCategory = $this->categoryMapper->map(['CategoryName' => $editCategoryName, 'CategoryID' > $category->id]);
                 $this->categoryEntityManager->update($mappedCategory);
                 $_POST = [];
                 $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id);

4) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:51    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             if ($editCategoryName === '') {
                 $this->viewInterface->addTlpParam('error', ['category' => 'Product Name musst be given']);
             } else {
-                $mappedCategory = $this->categoryMapper->map(['CategoryName' => $editCategoryName, 'CategoryID' => $category->id]);
+                $mappedCategory = $this->categoryMapper->map(['CategoryID' => $category->id]);
                 $this->categoryEntityManager->update($mappedCategory);
                 $_POST = [];
                 $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id);

5) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->viewInterface->addTlpParam('error', ['category' => 'Product Name musst be given']);
             } else {
                 $mappedCategory = $this->categoryMapper->map(['CategoryName' => $editCategoryName, 'CategoryID' => $category->id]);
-                $this->categoryEntityManager->update($mappedCategory);
+                
                 $_POST = [];
                 $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id);
             }

6) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id);
             }
         } elseif (isset($_POST['deleteCategory'])) {
-            $this->categoryEntityManager->delete($category->id);
+            
             $_POST = [];
             $this->redirect->redirect('index.php?area=Admin&page=Category');
         } elseif (isset($_POST['createProduct'])) {

7) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:68    [M] CastInt

--- Original
+++ New
@@ @@
                 $this->productEntityManager->insert($mappedProduct);
             }
         } elseif (isset($_POST['addProduct'])) {
-            $productID = (int) $_POST['selectProduct'];
+            $productID = $_POST['selectProduct'];
             $this->categoryProductEntityManager->insert($category->id, $productID);
             $_POST = [];
             $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id);

8) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $_POST = [];
         $this->viewInterface->addTlpParam('category', $category);
         $this->viewInterface->addTlpParam('productList', $this->productRepository->getList());
-        $this->viewInterface->addTlpParam('productListExcludeCategory', $this->productRepository->getListExcludeCategory());
+        
         $this->viewInterface->addTlpParam('editCategoryName', $editCategoryName);
         $this->viewInterface->addTemplate('backend/categoryDetail.tpl');
     }
 }

9) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:37    [M] Coalesce

--- Original
+++ New
@@ @@
     public function action() : void
     {
         $editProduct = [];
-        $categoryID = $_GET['categoryID'] ?? null;
+        $categoryID = null ?? $_GET['categoryID'];
         $product = $this->productRepository->getByID((int) $_GET['productID']);
         if ($categoryID === null) {
             $this->redirect->redirect('index.php?area=Admin&page=Category');

10) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:39    [M] CastInt

--- Original
+++ New
@@ @@
     {
         $editProduct = [];
         $categoryID = $_GET['categoryID'] ?? null;
-        $product = $this->productRepository->getByID((int) $_GET['productID']);
+        $product = $this->productRepository->getByID($_GET['productID']);
         if ($categoryID === null) {
             $this->redirect->redirect('index.php?area=Admin&page=Category');
         }

11) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:47    [M] Identical

--- Original
+++ New
@@ @@
             $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $categoryID);
         }
         if (isset($_POST['updateProduct'])) {
-            if (!isset($_POST["editProductName"]) || $_POST["editProductName"] === '') {
+            if (!isset($_POST["editProductName"]) || $_POST["editProductName"] !== '') {
                 $editProduct['name'] = '';
                 $editProduct['description'] = '';
                 $this->viewInterface->addTlpParam('error', 'Product name musst be given');

12) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:55    [M] Concat

--- Original
+++ New
@@ @@
                 $mappedProduct = $this->productMapper->map(['ProductID' => $product->id, 'ProductName' => $_POST["editProductName"], 'ProductDescription' => $_POST["editProductDescription"]]);
                 $this->productEntityManager->update($mappedProduct);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . '&productID=' . $product->id);
+                $this->redirect->redirect($categoryID . 'index.php?area=Admin&page=ProductDetail&categoryID=' . '&productID=' . $product->id);
             }
         } elseif (isset($_POST['deleteProduct'])) {
             $this->productEntityManager->delete($product->id);

13) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:55    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $mappedProduct = $this->productMapper->map(['ProductID' => $product->id, 'ProductName' => $_POST["editProductName"], 'ProductDescription' => $_POST["editProductDescription"]]);
                 $this->productEntityManager->update($mappedProduct);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . '&productID=' . $product->id);
+                $this->redirect->redirect($categoryID . '&productID=' . $product->id);
             }
         } elseif (isset($_POST['deleteProduct'])) {
             $this->productEntityManager->delete($product->id);

14) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:55    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $mappedProduct = $this->productMapper->map(['ProductID' => $product->id, 'ProductName' => $_POST["editProductName"], 'ProductDescription' => $_POST["editProductDescription"]]);
                 $this->productEntityManager->update($mappedProduct);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . '&productID=' . $product->id);
+                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . '&productID=' . $product->id);
             }
         } elseif (isset($_POST['deleteProduct'])) {
             $this->productEntityManager->delete($product->id);

15) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:55    [M] Concat

--- Original
+++ New
@@ @@
                 $mappedProduct = $this->productMapper->map(['ProductID' => $product->id, 'ProductName' => $_POST["editProductName"], 'ProductDescription' => $_POST["editProductDescription"]]);
                 $this->productEntityManager->update($mappedProduct);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . '&productID=' . $product->id);
+                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . '&productID=' . $categoryID . $product->id);
             }
         } elseif (isset($_POST['deleteProduct'])) {
             $this->productEntityManager->delete($product->id);

16) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:55    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $mappedProduct = $this->productMapper->map(['ProductID' => $product->id, 'ProductName' => $_POST["editProductName"], 'ProductDescription' => $_POST["editProductDescription"]]);
                 $this->productEntityManager->update($mappedProduct);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . '&productID=' . $product->id);
+                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . $product->id);
             }
         } elseif (isset($_POST['deleteProduct'])) {
             $this->productEntityManager->delete($product->id);

17) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:55    [M] Concat

--- Original
+++ New
@@ @@
                 $mappedProduct = $this->productMapper->map(['ProductID' => $product->id, 'ProductName' => $_POST["editProductName"], 'ProductDescription' => $_POST["editProductDescription"]]);
                 $this->productEntityManager->update($mappedProduct);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . '&productID=' . $product->id);
+                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . $product->id . '&productID=');
             }
         } elseif (isset($_POST['deleteProduct'])) {
             $this->productEntityManager->delete($product->id);

18) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:55    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $mappedProduct = $this->productMapper->map(['ProductID' => $product->id, 'ProductName' => $_POST["editProductName"], 'ProductDescription' => $_POST["editProductDescription"]]);
                 $this->productEntityManager->update($mappedProduct);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . '&productID=' . $product->id);
+                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . '&productID=');
             }
         } elseif (isset($_POST['deleteProduct'])) {
             $this->productEntityManager->delete($product->id);

19) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/ProductDetail.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $mappedProduct = $this->productMapper->map(['ProductID' => $product->id, 'ProductName' => $_POST["editProductName"], 'ProductDescription' => $_POST["editProductDescription"]]);
                 $this->productEntityManager->update($mappedProduct);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=ProductDetail&categoryID=' . $categoryID . '&productID=' . $product->id);
+                
             }
         } elseif (isset($_POST['deleteProduct'])) {
             $this->productEntityManager->delete($product->id);

20) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/Product.php:31    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function action() : void
     {
-        $categoryID = 0;
+        $categoryID = -1;
         $category = null;
         if (isset($_GET['categoryID'])) {
             $categoryID = (int) $_GET['categoryID'];

21) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/Product.php:34    [M] CastInt

--- Original
+++ New
@@ @@
         $categoryID = 0;
         $category = null;
         if (isset($_GET['categoryID'])) {
-            $categoryID = (int) $_GET['categoryID'];
+            $categoryID = $_GET['categoryID'];
             $category = $this->categoryRepository->getByID($categoryID);
             if ($category !== null) {
                 $productList = $this->productRepository->getList();

22) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/Product.php:45    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $this->viewInterface->addTemplate('product.tpl');
             }
         }
-        if ($categoryID === 0 || $category === null) {
+        if ($categoryID === -1 || $category === null) {
             $this->redirect->redirect('index.php');
         }
     }
 }

23) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/Product.php:45    [M] Identical

--- Original
+++ New
@@ @@
                 $this->viewInterface->addTemplate('product.tpl');
             }
         }
-        if ($categoryID === 0 || $category === null) {
+        if ($categoryID !== 0 || $category === null) {
             $this->redirect->redirect('index.php');
         }
     }
 }

24) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/Product.php:45    [M] Identical

--- Original
+++ New
@@ @@
                 $this->viewInterface->addTemplate('product.tpl');
             }
         }
-        if ($categoryID === 0 || $category === null) {
+        if ($categoryID === 0 || $category !== null) {
             $this->redirect->redirect('index.php');
         }
     }
 }

25) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/Product.php:45    [M] LogicalOr

--- Original
+++ New
@@ @@
                 $this->viewInterface->addTemplate('product.tpl');
             }
         }
-        if ($categoryID === 0 || $category === null) {
+        if ($categoryID === 0 && $category === null) {
             $this->redirect->redirect('index.php');
         }
     }
 }

27) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/ProductDetail.php:32    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function action() : void
     {
         $categoryID = 0;
-        $productID = 0;
+        $productID = -1;
         $category = null;
         $product = null;
         if (isset($_GET['categoryID'])) {

29) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/ProductDetail.php:40    [M] CastInt

--- Original
+++ New
@@ @@
             $category = $this->categoryRepository->getById($categoryID);
             if ($category !== null) {
                 if (isset($_GET['productID'])) {
-                    $productID = (int) $_GET['productID'];
+                    $productID = $_GET['productID'];
                     $product = $this->productRepository->getByID($productID);
                     if ($product !== null) {
                         $this->viewInterface->addTlpParam('category', $category);

32) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/ProductDetail.php:52    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         if ($categoryID === 0 || $category === null) {
             $this->redirect->redirect('index.php');
-        } elseif ($productID === 0 || $product === null) {
+        } elseif ($productID === -1 || $product === null) {
             $this->redirect->redirect('index.php?area=Consumer&page=Product&categoryID=' . $categoryID);
         }
     }
 }

33) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/ProductDetail.php:52    [M] Identical

--- Original
+++ New
@@ @@
         }
         if ($categoryID === 0 || $category === null) {
             $this->redirect->redirect('index.php');
-        } elseif ($productID === 0 || $product === null) {
+        } elseif ($productID !== 0 || $product === null) {
             $this->redirect->redirect('index.php?area=Consumer&page=Product&categoryID=' . $categoryID);
         }
     }
 }

34) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/ProductDetail.php:52    [M] Identical

--- Original
+++ New
@@ @@
         }
         if ($categoryID === 0 || $category === null) {
             $this->redirect->redirect('index.php');
-        } elseif ($productID === 0 || $product === null) {
+        } elseif ($productID === 0 || $product !== null) {
             $this->redirect->redirect('index.php?area=Consumer&page=Product&categoryID=' . $categoryID);
         }
     }
 }

35) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/ProductDetail.php:52    [M] LogicalOr

--- Original
+++ New
@@ @@
         }
         if ($categoryID === 0 || $category === null) {
             $this->redirect->redirect('index.php');
-        } elseif ($productID === 0 || $product === null) {
+        } elseif ($productID === 0 && $product === null) {
             $this->redirect->redirect('index.php?area=Consumer&page=Product&categoryID=' . $categoryID);
         }
     }
 }

36) /home/philipphermes/phpProjects/MVC/src/Core/UserValidation.php:31    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
         if (empty($errors)) {
             $getByUsername = $this->userRepository->getByUsername($username);
-            if ($getByUsername !== null && $username === $getByUsername->username && $password === $getByUsername->password) {
+            if (($getByUsername !== null || $username === $getByUsername->username) && $password === $getByUsername->password) {
                 return $errors;
             } else {
                 $errors[] = "Password and User don't match";

37) /home/philipphermes/phpProjects/MVC/src/Core/UserValidation.php:32    [M] ArrayOneItem

--- Original
+++ New
@@ @@
         if (empty($errors)) {
             $getByUsername = $this->userRepository->getByUsername($username);
             if ($getByUsername !== null && $username === $getByUsername->username && $password === $getByUsername->password) {
-                return $errors;
+                return count($errors) > 1 ? array_slice($errors, 0, 1, true) : $errors;
             } else {
                 $errors[] = "Password and User don't match";
             }

38) /home/philipphermes/phpProjects/MVC/src/Model/EntityManager/CategoryProductEntityManager.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function delete(int $categoryID, int $productID) : void
     {
         $query = $this->connection->prepare('DELETE FROM CategoryProduct WHERE CategoryID = ? AND ProductID = ?');
-        $query->execute([$categoryID, $productID]);
+        
     }
 }

39) /home/philipphermes/phpProjects/MVC/src/Model/Mapper/ProductMapper.php:24    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (isset($product['CategoryID'])) {
             $productDTO->categoryID = (int) $product['CategoryID'];
         } else {
-            $productDTO->categoryID = 0;
+            $productDTO->categoryID = -1;
         }
         return $productDTO;
     }
 }

40) /home/philipphermes/phpProjects/MVC/src/Model/Mapper/UserMapper.php:17    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (isset($user['UserID'])) {
             $userDTO->id = (int) $user['UserID'];
         } else {
-            $userDTO->id = 0;
+            $userDTO->id = -1;
         }
         $userDTO->username = $user['Username'] ?? '';
         $userDTO->password = $user['Password'] ?? '';

41) /home/philipphermes/phpProjects/MVC/src/Model/Repository/ProductRepository.php:26    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private function getCategoryID() : void
     {
-        $this->categoryID = 0;
+        $this->categoryID = -1;
         if (isset($_GET['categoryID'])) {
             $this->categoryID = $_GET['categoryID'];
         }


Timed Out mutants:
==================
