1) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:54    [M] Concat

--- Original
+++ New
@@ @@
                 $mappedCategory = $this->categoryMapper->map(['CategoryName' => $editCategoryName, 'CategoryID' => $category->id]);
                 $this->categoryEntityManager->update($mappedCategory);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id);
+                $this->redirect->redirect($category->id . 'index.php?area=Admin&page=CategoryDetail&categoryID=');
             }
         } elseif (isset($_POST['deleteCategory'])) {
             $this->categoryEntityManager->delete($category->id);

2) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $mappedCategory = $this->categoryMapper->map(['CategoryName' => $editCategoryName, 'CategoryID' => $category->id]);
                 $this->categoryEntityManager->update($mappedCategory);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id);
+                $this->redirect->redirect($category->id);
             }
         } elseif (isset($_POST['deleteCategory'])) {
             $this->categoryEntityManager->delete($category->id);

3) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $mappedCategory = $this->categoryMapper->map(['CategoryName' => $editCategoryName, 'CategoryID' => $category->id]);
                 $this->categoryEntityManager->update($mappedCategory);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id);
+                $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=');
             }
         } elseif (isset($_POST['deleteCategory'])) {
             $this->categoryEntityManager->delete($category->id);

4) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $mappedCategory = $this->categoryMapper->map(['CategoryName' => $editCategoryName, 'CategoryID' => $category->id]);
                 $this->categoryEntityManager->update($mappedCategory);
                 $_POST = [];
-                $this->redirect->redirect('index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id);
+                
             }
         } elseif (isset($_POST['deleteCategory'])) {
             $this->categoryEntityManager->delete($category->id);
