1) /home/philipphermes/phpProjects/MVC/src/Controller/Backend/CategoryDetail.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->categoryEntityManager->update($mappedCategory);
                 $_POST = [];
                 $link = 'index.php?area=Admin&page=CategoryDetail&categoryID=' . $category->id;
-                $this->redirect->redirect($link);
+                
             }
         } elseif (isset($_POST['deleteCategory'])) {
             $this->categoryEntityManager->delete($category->id);

13) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/Product.php:26    [M] CastInt

--- Original
+++ New
@@ @@
         $this->viewInterface = $container->get(ViewInterface::class);
         $productRepository = $container->get(ProductRepository::class);
         $categoryRepository = $container->get(CategoryRepository::class);
-        $this->category = $categoryRepository->getByID((int) $_GET['categoryID']);
+        $this->category = $categoryRepository->getByID($_GET['categoryID']);
         $this->productList = $productRepository->getList();
     }
     public function action() : void

15) /home/philipphermes/phpProjects/MVC/src/Controller/Frontend/ProductDetail.php:33    [M] CastInt

--- Original
+++ New
@@ @@
     }
     public function action() : void
     {
-        $productID = (int) $_GET['productID'];
+        $productID = $_GET['productID'];
         $product = $this->productRepository->getByID($productID);
         $this->viewInterface->addTlpParam('category', $this->category);
         $this->viewInterface->addTlpParam('product', $product);

16) /home/philipphermes/phpProjects/MVC/src/Core/Provider/DependencyProvider.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(UserRepository::class, new UserRepository($database, $container->get(UserMapper::class)));
         $container->set(CategoryRepository::class, new CategoryRepository($database, $container->get(CategoryMapper::class)));
         $container->set(ProductRepository::class, new ProductRepository($database, $container->get(ProductMapper::class)));
-        //EntityManager
-        $container->set(UserEntityManager::class, new UserEntityManager($database));
+        
         $container->set(CategoryEntityManager::class, new CategoryEntityManager($database));
         $container->set(ProductEntityManager::class, new ProductEntityManager($database, $container->get(ProductRepository::class)));
         $container->set(CategoryProductEntityManager::class, new CategoryProductEntityManager($database));

17) /home/philipphermes/phpProjects/MVC/src/Core/Provider/DependencyProvider.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(CategoryProductEntityManager::class, new CategoryProductEntityManager($database));
         //Others
         $container->set(UserValidation::class, new UserValidation($container->get(UserRepository::class)));
-        $container->set(AdminLogin::class, new AdminLogin($container->get(UserRepository::class)));
+        
     }
 }

18) /home/philipphermes/phpProjects/MVC/src/Core/UserValidation.php:20    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     public function validation(array $user = []) : array
     {
         $errors = [];
-        $username = trim($user['username']) ?? '';
+        $username = $user['username'] ?? '';
         $password = trim($user['password']) ?? '';
         if ($username === '') {
             $errors[] = 'User musst be given';

19) /home/philipphermes/phpProjects/MVC/src/Core/UserValidation.php:21    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     {
         $errors = [];
         $username = trim($user['username']) ?? '';
-        $password = trim($user['password']) ?? '';
+        $password = $user['password'] ?? '';
         if ($username === '') {
             $errors[] = 'User musst be given';
         }

21) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:16    [M] Concat

--- Original
+++ New
@@ @@
     public function __construct(\Smarty $smarty)
     {
         $this->smarty = $smarty;
-        $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
+        $this->smarty->setTemplateDir('/../../../template' . __DIR__);
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');

22) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:16    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function __construct(\Smarty $smarty)
     {
         $this->smarty = $smarty;
-        $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
+        $this->smarty->setTemplateDir('/../../../template');
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');

23) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:16    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function __construct(\Smarty $smarty)
     {
         $this->smarty = $smarty;
-        $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
+        $this->smarty->setTemplateDir(__DIR__);
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');

24) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(\Smarty $smarty)
     {
         $this->smarty = $smarty;
-        $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
+        
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');

25) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:17    [M] Concat

--- Original
+++ New
@@ @@
     {
         $this->smarty = $smarty;
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
-        $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
+        $this->smarty->setCompileDir('/../../../smarty/templates_c' . __DIR__);
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
     }

26) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:17    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $this->smarty = $smarty;
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
-        $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
+        $this->smarty->setCompileDir('/../../../smarty/templates_c');
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
     }

27) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:17    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $this->smarty = $smarty;
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
-        $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
+        $this->smarty->setCompileDir(__DIR__);
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
     }

28) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->smarty = $smarty;
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
-        $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
+        
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
     }

29) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:18    [M] Concat

--- Original
+++ New
@@ @@
         $this->smarty = $smarty;
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
-        $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
+        $this->smarty->setCacheDir('/../../../smarty/cache' . __DIR__);
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
     }
     public function addTlpParam(string $key, $value) : void

30) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:18    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $this->smarty = $smarty;
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
-        $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
+        $this->smarty->setCacheDir('/../../../smarty/cache');
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
     }
     public function addTlpParam(string $key, $value) : void

31) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:18    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $this->smarty = $smarty;
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
-        $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
+        $this->smarty->setCacheDir(__DIR__);
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
     }
     public function addTlpParam(string $key, $value) : void

32) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:18    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->smarty = $smarty;
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
-        $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
+        
         $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
     }
     public function addTlpParam(string $key, $value) : void

33) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:19    [M] Concat

--- Original
+++ New
@@ @@
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
-        $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
+        $this->smarty->setConfigDir('/../../../smarty/configs' . __DIR__);
     }
     public function addTlpParam(string $key, $value) : void
     {

34) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:19    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
-        $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
+        $this->smarty->setConfigDir('/../../../smarty/configs');
     }
     public function addTlpParam(string $key, $value) : void
     {

35) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:19    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
-        $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
+        $this->smarty->setConfigDir(__DIR__);
     }
     public function addTlpParam(string $key, $value) : void
     {

36) /home/philipphermes/phpProjects/MVC/src/Core/View/SmartyView.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->smarty->setTemplateDir(__DIR__ . '/../../../template');
         $this->smarty->setCompileDir(__DIR__ . '/../../../smarty/templates_c');
         $this->smarty->setCacheDir(__DIR__ . '/../../../smarty/cache');
-        $this->smarty->setConfigDir(__DIR__ . '/../../../smarty/configs');
+        
     }
     public function addTlpParam(string $key, $value) : void
     {

37) /home/philipphermes/phpProjects/MVC/src/Model/Database.php:16    [M] Coalesce

--- Original
+++ New
@@ @@
     public function __construct($settings = [])
     {
         $this->dbSettings['server'] = $settings['server'] ?? "localhost";
-        $this->dbSettings['user'] = $settings['user'] ?? "philipp";
+        $this->dbSettings['user'] = "philipp" ?? $settings['user'];
         $this->dbSettings['password'] = $settings['password'] ?? "nexusval";
         $this->dbSettings['database'] = $settings['database'] ?? "MVC";
         $this->dbSettings['charset'] = $settings['charset'] ?? "utf8mb4";

38) /home/philipphermes/phpProjects/MVC/src/Model/Database.php:17    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $this->dbSettings['server'] = $settings['server'] ?? "localhost";
         $this->dbSettings['user'] = $settings['user'] ?? "philipp";
-        $this->dbSettings['password'] = $settings['password'] ?? "nexusval";
+        $this->dbSettings['password'] = "nexusval" ?? $settings['password'];
         $this->dbSettings['database'] = $settings['database'] ?? "MVC";
         $this->dbSettings['charset'] = $settings['charset'] ?? "utf8mb4";
     }

39) /home/philipphermes/phpProjects/MVC/src/Model/Database.php:18    [M] Coalesce

--- Original
+++ New
@@ @@
         $this->dbSettings['server'] = $settings['server'] ?? "localhost";
         $this->dbSettings['user'] = $settings['user'] ?? "philipp";
         $this->dbSettings['password'] = $settings['password'] ?? "nexusval";
-        $this->dbSettings['database'] = $settings['database'] ?? "MVC";
+        $this->dbSettings['database'] = "MVC" ?? $settings['database'];
         $this->dbSettings['charset'] = $settings['charset'] ?? "utf8mb4";
     }
     public function connect() : void

40) /home/philipphermes/phpProjects/MVC/src/Model/Database.php:19    [M] Coalesce

--- Original
+++ New
@@ @@
         $this->dbSettings['user'] = $settings['user'] ?? "philipp";
         $this->dbSettings['password'] = $settings['password'] ?? "nexusval";
         $this->dbSettings['database'] = $settings['database'] ?? "MVC";
-        $this->dbSettings['charset'] = $settings['charset'] ?? "utf8mb4";
+        $this->dbSettings['charset'] = "utf8mb4" ?? $settings['charset'];
     }
     public function connect() : void
     {

41) /home/philipphermes/phpProjects/MVC/src/Model/Database.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         try {
             $dsn = "mysql:host=" . $this->dbSettings['server'] . ";dbname=" . $this->dbSettings['database'] . ";charset=" . $this->dbSettings['charset'];
             $this->connection = new \PDO($dsn, $this->dbSettings['user'], $this->dbSettings['password']);
-            $this->connection->setAttribute(\PDO::ATTR_ERRMODE, \PDO::ERRMODE_EXCEPTION);
+            
         } catch (\PDOException $error) {
             throw new \PDOException("Connection failed: " . $error->getMessage());
         }

42) /home/philipphermes/phpProjects/MVC/src/Model/Repository/ProductRepository.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function getListExcludeCategory() : array
     {
-        $this->getCategoryID();
+        
         $this->productDataTransferObjectListExcludeCategory = [];
         $query = $this->database->getConnection()->prepare('SELECT * FROM Product p JOIN CategoryProduct cp ON p.ProductID = cp.ProductID WHERE cp.CategoryID != ?');
         $query->execute([$this->categoryID]);


Timed Out mutants:
==================
